// Conseptual Session :01
// Basic JavaScript - Gias Uddin Hasan.

// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-1: 
// =========================//=========================//=========================
// 1.গ্রেড মেকিং এর বাকি অংশটুকু করে ফেলতে হবে নিজে নিজে 

// var marks = 100;
// if (marks >= 80 && marks <= 100) {
//     console.log('You Got A+');
// }
// else if (marks >= 70 && marks <= 79) {
//     console.log('You Got A');
// }
// else if (marks >= 60 && marks <= 69) {
//     console.log('You Got B+');
// }
// else if (marks >= 50 && marks <= 59) {
//     console.log('You Got B');
// }
// else if (marks >= 40 && marks <= 49) {
//     console.log('You Got C');
// }
// else if (marks >= 33 && marks <= 39) {
//     console.log('You Got D');
// }
// else if (marks >= 0 && marks <= 32) {
//     console.log('You Failed');
// }
// else {
//     console.log('Please Input a Valid Number from 0 to 100');
// }


// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-2: 
// =========================//=========================//=========================
// ২. এমন একটা প্রোগ্রাম লিখো যেখানে একটা নম্বর ইনপুট করলে কনসোল এ বলে দিবে যে এইটা জোর নাকি বিজোড় 

// var number = 4;
// if (number % 2 == 0) {
//     console.log('Even');
// }
// else {
//     console.log('Odd');
// }


// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-3: 
// =========================//=========================//=========================
// ৩. একটা এরে থাকবে এরে এর মধ্যে ১-২০ পর্যন্ত নম্বর গুলা এলোমেলো থাকবে আপনার কাজ হবে ক্রোম অনুসারে সাজানো 

// var numbers = [6, 5, 3, 4, 2, 1, 7, 9, 8, 10, 13, 11, 12, 15, 14, 17, 16, 19, 18, 20];
// numbers.sort((a, b) => a - b);
// console.log(numbers);


// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-4: 
// =========================//=========================//=========================
// ৪.এমন একটা প্রোগ্রাম লিখো যেখানে নম্বর ইনপুট করলে বলে এইটা লিপ ইয়ার কি না ?

// var year = 1900;
// if ((year % 4 == 0) && (year % 100 != 0) || (year % 400 == 0)) {
//     console.log('Leap year');
// }
// else {
//     console.log('Not a Leap year');
// }


// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-5: 
// =========================//=========================//=========================
// ৫. ১-৫০ এর মধ্যে ৩ এবং ৫ দিয়ে বিভাজ্য সংখ্যা গুলা বের করো 

// for (i = 1; i <= 50; i++) {
//     if (i % 3 == 0 && i % 5 == 0) {
//         console.log(i);
//     }
// }


// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-6: 
// =========================//=========================//=========================
// var friends = ["rahim", "karim", "abdul", "sadsd", "heroAlom"];

// ৬.উপরে এর এরে থেকে যেখানে ৫ টা ফ্রেন্ড এর নাম এর মধ্যে বড়ো নাম কোন ফ্রেন্ড এর খুঁজে বের করা 
// var friends = ["rahim", "karim", "anar koli moli doliiiiiiiiiiiiii", "sadsd", "heroAlom", "anar koli moli doligggghhhhhhhhhhhhh"];
// var sample = friends[0];
// for (var i = 0; i < friends.length; i++) {
//     if (friends[i].length > sample.length) {
//         sample = friends[i];

//     }
// }
// console.log(sample);


// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-7: 
// =========================//=========================//=========================
// var numbers = [1, 2, 3, 3, 4, 4, 5, 6, 7, 8, 9, 10];
// ৭. উবের পরের এরে থেকে ডুপ্লিকেট নম্বর গুলা বাদ দিয়ে উনিক নম্বর গুলা বের করতে হবে 
// var numbers = [1, 2, 3, 3, 4, 4, 5, 6, 7, 8, 9, 10];
// var uniqArray = [];
// for (var i = 0; i < numbers.length; i++) {
//     if (uniqArray.indexOf(numbers[i]) === -1) {
//         uniqArray.push(numbers[i]);
//     }
// }
// console.log(uniqArray);


// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-1: 
// =========================//=========================//=========================
// var numbers = [1, 2, 3, 3, 4, 4, 5, 6, 7, 8, 9, 10];
// 8. উপরের আরে থেকে সব থেকে বড়ো নম্বর কোনটা বের করো

// var numbers = [1, 2, 33, 3, 4, 4, 5, 6, 7, 8, 9, 10];
// var big = numbers[0];
// for (i = 0; i < numbers.length; i++) {
//     if (numbers[i] > big) {
//         big = numbers[i];
//     }
// }
// console.log(big);