// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-1: 
// =========================//=========================//=========================
// ১. তোমাকে যদি বলি একটা স্ট্রিং টাইপের ভেরিয়েবল লিখো। একটা বুলিয়ান টাইপের ভেরিয়েবল লিখো বা একটা নাম্বার টাইপের ভেরিয়েবল লিখো। সেটা কি তুমি লিখতে পারবে? যদি পারো তাহলে ভিজুয়াল ষ্টুডিও কোড খুলে লিখে ফেলো। 

// var string = 'String';
// var number = 21;
// var isFalse = false;



// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-2: 
// =========================//=========================//=========================
// ২. তুমি কি জানো কখন let দিয়ে ভেরিয়েবল লিখতে হয়ে আর কখন const দিয়ে ভেরিয়েবল লিখতে হয়। যদি লিখতে পারো তাহলে লিখে ফেলো। এবং যেই যেটা দিয়ে ভেরিয়েবল লিখলে আবার সেটা চেইঞ্জ করা যায়। তাহলে যেটা দিয়ে ভেরিয়েবল ডিক্লেয়ার করলে চেইঞ্জ করা যায়। সেটার মান চেইঞ্জ করে নাও । অর্থাৎ জাস্ট দুইটা ভেরিয়েবল ডিক্লেয়ার করবে let এবং const দিয়ে। তারপর যেকোন একটার ভ্যালু চেইঞ্জ করবে। এই let এবং const মাথা গরম করে দিলে টেনশন নিয়ে না। সামনের মাইলস্টোন এর পরের মাইলস্টোন এ এইটা নিয়ে আরো ডিসকাস করা হবে। 

// let changableVariable = 'Yes'; // It can be change.
// const constCantBeChanged = 'ok'; // It can't be change.
// changableVariable = 'Yes Yes';
// console.log(changableVariable);


// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-3: 
// =========================//=========================//=========================
// ৩. দুইটা ভেরিয়েবল এর মধ্যে যোগ, বিয়োগ, গুণ, ভাগ কিভাবে করতে হয় সেটা কি জানো। অর্থাৎ তুমি কি +, -, *, /, %এইগুলার ব্যবহার জানো। তাহলে নাম্বার টাইপের দুইটা ভেরিয়েবল লিখো তারপর তাদের যোগ করে সেটার মান আরেকটা ভেরিয়েবল এ রাখো। একইভাবে ওই দুইটা ভেরিয়েবল এর মধ্যে বিয়োগ, গুন, ভাগ এবং ভাগশেষ বের করো। 

// let num1 = 10;
// let num2 = 20;

// const sum = num1 + num2;
// const sub = num1 - num2;
// const mul = num1 * num2;
// const div = num1 / num2;
// const modu = num1 % num2;
// console.log(sum, sub, mul, div, modu);




// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-4: 
// =========================//=========================//=========================
// ৪. তুমি কি দুইটা ভেরিয়েবল এরমধ্যে তুলনা করতে পারো। কম্পারিজন করতে পারো। যে দুইটা ভেরিয়েবল এর মধ্যে প্রথমটা সেকেন্ডটা এর চাইতে ছোট, বড়, অসমান, সমান , ছোট বা সমান, বড় বা সমান। এইগুলা চেক করতে পারো। অর্থাৎ <, >, ==, !=, <=, >= চিহ্নগুলা ব্যবহার করতে পারো। তাহলে দুইটা সংখ্যা টাইপের ভেরিয়েবল ডিক্লেয়ার করে তাদেরকে এই ছয়ভাবে তুলনা করে কোড লিখে ফেলো। 

// let num1 = 10;
// let num2 = 20;

// // Smaller Than, Greated Than
// if (num1 < num2) {
//     console.log(num1, 'is smaller than:', num2);
// }
// else {
//     console.log(num2, 'is smaller than:', num1);
// }

// // Not Equal
// if (num1 != num2) {
//     console.log('Osoman');
// }
// else {
//     console.log('Soman');
// }

// // Equal
// if (num1 == num2) {
//     console.log('Soman');
// }
// else {
//     console.log('Osoman');
// }

// // Less Than Equal
// if (num1 <= num2) {
//     console.log('Less Than Equal');
// }
// else {
//     console.log('Greated Than');
// }

// // Greater Than Equal
// if (num1 >= num2) {
//     console.log('Greater Than Equal');
// }
// else {
//     console.log('Less Than');
// }



// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-6: 
// =========================//=========================//=========================
// ৫. তোমার যদি দুইটা শর্ত পূরণ করতে বলে। এবং দুইটা শর্তের মধ্যে দুইটাই পূরণ করতে হবে। তাহলে তুমি কি সেটা চেক করতে পারবে? একইভাবে যদি বলে তুমি দুইটা শর্তের যেকোন একটা পূরণ করতে পারবে। অর্থাৎ তুমি && এবং || এর ব্যবহার করতে পারো কিনা। যদি পারো তাহলে নিজে নিজে এই রকমের কোড লিখে ফেলো। 

// let conditionOne = 10;
// let conditionTwo = 15;

// if (conditionOne == 10 || conditionTwo == 11) { // Its print "Even" because It's should be only one condition true.
//     console.log('Even');
// }
// else {
//     console.log('Odd');
// }

// if (conditionOne == 10 && conditionTwo == 11) { // Its print "Odd" because It's should be both condition true.
//     console.log('Even');
// }
// else {
//     console.log('Odd');
// }



// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-6: 
// =========================//=========================//=========================
// ৬. তুমি কি একটা শর্ত পালন করলে একটা কিছু করবে। শর্ত পূরণ না করলে অন্য কিছু একটা করবে এমন কোড লিখতে পারবে। অর্থাৎ তুমি কি if-else এর কোড লিখতে পারবে। পারলে একটা কোড লিখে ফেলো 

// let conditionOne = 2;
// let conditionTwo = 4;
// if (conditionOne != conditionTwo) {
//     var sum = conditionOne + conditionTwo;
//     console.log(sum);
// }
// else {
//     var sub = conditionOne - conditionTwo;
//     console.log(sub);
// }



// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-7: 
// =========================//=========================//=========================
// ৭. তোমাকে যদি বলে একটা while লুপ দিয়ে ৭ থেকে ১৯ পর্যন্ত যতগুলা বিজোড় সংখ্যা আছে সেগুলা দেখাতে। তুমি কি সেটা দেখাতে পারবে? পারলে সেই কোড লিখে ফেলো। 

// let i = 7;
// while (i <= 19) {
//     console.log(i);
//     i += 2;
// }



// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-8: 
// =========================//=========================//=========================
// ৮. তোমাকে যদি বলা হয় তুমি একটা array ডিক্লেয়ার করবে। এবং সেটার মধ্যে কয়টা উপাদান আছে সেটা বের করবে হবে। সেই array এর এর মধ্যে চতুর্থ পজিশন এর উপাদান চেইঞ্জ করতে হবে। array এর মধ্যে দুইটা উপাদান যোগ করতে হবে। এবং একটা উপাদান কে বের করে দিতে হবে। তুমি কি সেটা করতে পারবে। 

// var array = [1, 2, 4, 5, 61, 12, 31];
// console.log(array.length);
// array.splice(3, 1, 33, 44);
// console.log(array);


// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-9: 
// =========================//=========================//=========================
// ৯. তুমি কি একটা ফর লুপ দিয়ে কোন একটা array এর সবগুলা উপাদানকে দেখাতে পারবে। সেটা রেগুলার for লুপ হোক বা for of হোক। হলে সেই স্টাইলে একটা কোড লিখে ফেলো। 

// var array = [1, 2, 4, 5, 61, 12, 31];
// For Loop
// for (i = 0; i < array.length; i++) {
//     console.log(array[i]);
// }

//For Of Loop.
// for (var i of array) {
//     console.log(i);
// }



// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-10: 
// =========================//=========================//=========================
// ১০. তোমাকে যদি বলা হয়। একটা array এর মধ্যে ৮০ এর চাইতে বড় সংখ্যা থাকলে সেগুলাকে console log করে দেখাতে সেটা কি তুমি পারবে? তাহলে তুমি সেই কোড করে ফেলো.

// var numbers = [1, 70, 75, 80, 12, 84, 102, 103];
// for (let index = 0; index < numbers.length; index++) {
//     const element = numbers[index];
//     if (element < 80) {
//         continue;
//     }
//     console.log(element);
// }


// =========================//=========================//=========================
// প্রাকটিস চ্যালেঞ্জ-11: 
// =========================//=========================//=========================
// ১১. তিনটা সংখ্যার গুনফল বের করে ফাইনাল রেজাল্ট আউটপুট হিসেবে রিটার্ন করতে হবে। তুমি কি সেই কোড লিখতে পারবে। যদি পারো তাহলে সেই কোড লিখে ফেলো। 
// function gunFol(num) {
//     for (i = 1; i <= num; i++) {
//         var mul = i * num;
//     }
//     return mul;
// }
// var result = gunFol(3);
// console.log(result);



// // =========================//=========================//=========================
// // প্রাকটিস চ্যালেঞ্জ-12: 
// // =========================//=========================//=========================
// ১২. একটা অবজেক্ট ডিক্লেয়ার করবে। সেটাতে তিনটা প্রপার্টি থাকবে। এবং কোন একটা প্রোপার্টি এর মান চেইঞ্জ করবা। 

// var gadget = {
//     phone: 'iPhone',
//     laptop: 'Macbook',
//     maried: 'yes'
// }
// gadget.phone = 'Nokia';
// console.log(gadget);




// =========================//=========================//=========================
// =========================//=========================//=========================
// =========================//=========================//=========================
// প্রব্লেম সলভিং চেকলিস্ট / সেলফ এসেসমেন্ট:
// =========================//=========================//=========================
// =========================//=========================//=========================
// =========================//=========================//=========================


// =========================//=========================//=========================
// প্রব্লেম সলভিং চেকলিস্ট-1: 
// =========================//=========================//=========================

// ১. সিম্পল একটা ফাংশন লিখতে হবে। যেটার নাম হবে feetToInch এবং এই ফাংশন ইনপুট হিসেবে নিবে feet আর রিটার্ন করবে inch । অর্থাৎ এই ফাংশনকে কোন একটা ফিট বলে দিলে সে রিটার্ন হিসেবে বলে দিবে কত ইঞ্চি হয়।

// function feetToInch(feet) {
//     const inch = feet * 12;
//     return inch;
// }
// let feetValue = 2;
// var result = feetToInch(feetValue);
// console.log(result);




// =========================//=========================//=========================
// প্রব্লেম সলভিং চেকলিস্ট-2: 
// =========================//=========================//=========================
// ২. একদম ফাংশন এর নাম হুবহু centimeterToMeter নাম দিয়ে একটা ফাংশন লিখবে। এই ফাংশনে ইনপুট হিসাবে কেউ সেন্টিমিটার দিবে আর সেই সেন্টিমিটার কে মিটার এ কনভার্ট করে রেজাল্ট রিটার্ন করবে। 


// function centimeterToMeter(cm) {
//     const metar = cm / 100;
//     return metar;
// }
// let cmValue = 2;
// var result = centimeterToMeter(cmValue);
// console.log(result);



// =========================//=========================//=========================
// প্রব্লেম সলভিং চেকলিস্ট-3: 
// =========================//=========================//=========================
// ৩. আরেকটা ফাংশন লিখবে যেটার নাম লিখবে। যেই ফাংশনের নাম হবে paperRequirements এই ফাংশনের প্যারামিটার হিসেবে তিনটা প্যারামিটার হবে। প্রথম প্যারামিটার হবে তুমি প্রথম বই কত কপি ছাপাতে চাও। সেকেন্ড প্যারামিটার হবে তুমি সেকেন্ড বই কত কপি ছাপাতে চাও। আর থার্ড প্যারামিটার হবে তুমি থার্ড বই কত কপি ছাপাতে চাও। অর্থাৎ কোন বই এর কত কপি ছাপানো হবে সেটাই প্যারামিটার হিসেবে নিবে। 

// এইবার ভালো করে খেয়াল করো। 
// প্রথম বই ছাপানোর জন্য পৃষ্ঠা লাগবে ১০০ টা 
// সেকেন্ড বই ছাপানোর জন্য পৃষ্ঠা লাগবে ২০০ টা 
// তৃতীয় বই ছাপানোর জন্য পৃষ্ঠা লাগবে ৩০০ টা 
// এখন তোমার কাজ হচ্ছে paperRequirements নামক ফাংশন লিখে ফেলা যাতে। সেই ফাংশনকে কল করে কোন বই এর কত কপি লাগবে বলে দিবে প্যারামিটার হিসেবে। আর ফাংশন হিসাব করে বলে দিবে তোমার সর্বমোট কতপৃষ্ঠা কাগজ লাগবে। 
// উত্তর হিসেবে সংখ্যা রিটার্ন করবে। 


// function paperRequirements(fBookCopy, sBookCopy, tBookCopy) {
//     let firstBookPageNedded = 100 * fBookCopy;
//     let secBookPageNedded = 200 * sBookCopy;
//     let thirdBookPageNedded = 300 * tBookCopy;
//     let totalPageNeeded = firstBookPageNedded + secBookPageNedded + thirdBookPageNedded;
//     return totalPageNeeded;
// }
// let copyOfFirstBook = 1;
// let copyOfSecBook = 1;
// let copyOfThirdBook = 1;
// var result = paperRequirements(copyOfFirstBook, copyOfSecBook, copyOfThirdBook);
// console.log('Total Page Needed:', result);



// =========================//=========================//=========================
// প্রব্লেম সলভিং চেকলিস্ট-4: 
// =========================//=========================//=========================
// ৪. একটা ফাংশন লিখবে। এই ফাংশনের নাম হবে bestFriend তারপর সেই ফাংশনে ইনপুট প্যারামিটার হিসেবে একটা array নিবে। সেই array এর মধ্যে তোমার সব ফ্রেন্ডের নাম থাকবে। এখন তোমার কাজ হচ্ছে যে ফ্রেন্ড এর নাম সবচেয়ে বড় সেই ফ্রেন্ড এর নাম রিটার্ন করে দেয়া। এই ক্ষেত্রে তুমি নামটা অর্থাৎ ফ্রেন্ডের নাম (স্ট্রিং) রিটার্ন করতে হবে। 

// function bestFriend(array) {
//     var defaultBigName = array[0];
//     for (i = 0; i < array.length; i++) {
//         if (array[i].length > defaultBigName.length) {
//             defaultBigName = array[i];
//         }
//     }
//     return defaultBigName;
// }
// var friendsName = ['Sakibul Islam', 'Jahid', 'Sadman', 'Bushra', 'Hanjalal', 'Sagor', 'Kader kha', 'Cukini Adabor tero'];
// var result = bestFriend(friendsName);
// console.log(result);



// =========================//=========================//=========================
// প্রব্লেম সলভিং চেকলিস্ট-5: 
// =========================//=========================//=========================
// ৫. এইটা একটু ট্রিকি হতে পারে। একটা array এর মধ্যে অনেকগুলা সংখ্যা থাকবে। তোমার কাজ হচ্ছে সংখ্যা গুলা একটার পর একটা করে চেক করা। এবং সংখ্যা গুলা যদি পজিটিভ সংখ্যা হয়। অর্থাৎ শূন্য বা শূন্যের চাইতে বড় হয় তাহলে সেগুলাকে কোন একটা array এর মধ্যে রাখবে। আর যদি নেগেটিভ সংখ্যা হয়। তাহলে লুপটা স্টপ করে দিবে। এবং লুপ বন্ধ করার আগ পর্যন্ত যতগুলা পজিটিভ সংখ্যা পাওয়া গেছে। সেগুলা রিটার্ন করে দিবে। 
// var numbers = [2, 4, 6, 1, 3, 6, 7, 9, -89, 09, 99, 90, 103, 12];
// function positiveNumber(array) {
//     var positiveArray = [];
//     for (i = 0; i < array.length; i++) {
//         if (array[i] % 2 >= 0) {
//             positiveArray.push(array[i]);
//         } else {
//             break;
//         }
//     }
//     return positiveArray;
// }
// var result = positiveNumber(numbers);
// console.log(result);